taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_K20_DFP.1.5.2.pdsc
<!-- MK28F15 Devices -->
      <!-- ******************************  MK28FN2M0xxx15  ****************************** -->
      <device Dname="MK28FN2M0xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK28F15.h" define="MK28FN2M0xxx15"/>
        <debug svd="SVD/MK28F15.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00200000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00040000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFC0000" size="0x00040000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P2M0.FLM" start="0x00000000" size="0x00200000"             default="1"/>

        <book name="Documents/K28P210M150SF5RM.pdf" title="K28F MCU Sub-Family Reference Manual"/>
        <book name="Documents/K28P210M150SF5.pdf"   title="K28F MCU Sub-Family Data Sheet"/>
      </device>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="K20 50MHz">
      <description>NXP Kinetis K20 device series</description>
      <require Dvendor="NXP:11" Dname="MK20DX128xxx5"/>
    </condition>

    <!-- device Conditions -->
    <condition id="MK20D5">
      <description>NXP Kinetis MK20D5 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DN128xxx5"/>
      <accept  Dname="MK20DN32xxx5"/>
      <accept  Dname="MK20DN64xxx5"/>
      <accept  Dname="MK20DX128xxx5"/>
      <accept  Dname="MK20DX32xxx5"/>
      <accept  Dname="MK20DX64xxx5"/>
    </condition>

    <condition id="MK20D10">
      <description>NXP Kinetis MK20D10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DN512xxx10"/>
      <accept  Dname="MK20DX128xxx10"/>
      <accept  Dname="MK20DX256xxx10"/>
    </condition>

    <condition id="MK20D7">
      <description>NXP Kinetis MK20D7 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20DX128xxx7"/>
      <accept  Dname="MK20DX256xxx7"/>
      <accept  Dname="MK20DX64xxx7"/>
    </condition>

    <condition id="MK20F12">
      <description>NXP Kinetis MK20F12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK20FN1M0xxx12"/>
      <accept  Dname="MK20FX512xxx12"/>
    </condition>

    <condition id="MK21D5">
      <description>NXP Kinetis MK21D5 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21DN512xxx5"/>
      <accept  Dname="MK21DX128xxx5"/>
      <accept  Dname="MK21DX256xxx5"/>
    </condition>

    <condition id="MK21F10">
      <description>NXP Kinetis MK21F10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21FN1M0xxx10"/>
      <accept  Dname="MK21FX512xxx10"/>
    </condition>

    <condition id="MK22D5">
      <description>NXP Kinetis MK22D5 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22DN512xxx5"/>
      <accept  Dname="MK22DX128xxx5"/>
      <accept  Dname="MK22DX256xxx5"/>
    </condition>

    <condition id="MK22F10">
      <description>NXP Kinetis MK22F10 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN1M0xxx10"/>
      <accept  Dname="MK22FX512xxx10"/>
    </condition>

    <condition id="MK24F12">
      <description>NXP Kinetis MK24F12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK24FN1M0xxx12"/>
    </condition>

    <condition id="MK22F12810">
      <description>NXP Kinetis MK22F12810 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN128xxx10"/>
    </condition>

    <condition id="MK22F25612">
      <description>NXP Kinetis MK22F25612 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN256xxx12"/>
    </condition>

    <condition id="MK22F51212">
      <description>NXP Kinetis MK22F51212 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN512xxx12"/>
    </condition>

    <condition id="MK24F25612">
      <description>NXP Kinetis MK24F25612 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK24FN256xxx12"/>
    </condition>

    <condition id="MK21F12">
      <description>NXP Kinetis MK21F12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21FN1M0xxx12"/>
      <accept  Dname="MK21FX512xxx12"/>
    </condition>

    <condition id="MK21FA12">
      <description>NXP Kinetis MK21FA12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21FX512Axxx12"/>
      <accept  Dname="MK21FN1M0Axxx12"/>
    </condition>

    <condition id="MK22F12">
      <description>NXP Kinetis MK22F12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN1M0xxx12"/>
      <accept  Dname="MK22FX512xxx12"/>
    </condition>

    <condition id="MK22FA12">
      <description>NXP Kinetis MK22FA12 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK22FN1M0Axxx12"/>
      <accept  Dname="MK22FX512Axxx12"/>
    </condition>

    <condition id="MK21DA5">
      <description>NXP Kinetis MK21DA5 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK21DX128Axxx5"/>
      <accept  Dname="MK21DX256Axxx5"/>
      <accept  Dname="MK21DN512Axxx5"/>
    </condition>

    <condition id="MK26F18">
      <description>NXP Kinetis MK26F18 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK26FN2M0xxx18"/>
    </condition>

    <condition id="MK27F15">
      <description>NXP Kinetis MK27F15 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK27FN2M0xxx15"/>
    </condition>

    <condition id="MK28F15">
      <description>NXP Kinetis MK28F15 device</description>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK28FN2M0xxx15"/>
    </condition>


    <!-- device + CMSIS Conditions -->
    <condition id="MK20D5 CMSIS">
      <description>NXP Kinetis MK20D5 device and CMSIS-CORE</description>
      <require condition="MK20D5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="MK20D7 CMSIS">
      <description>NXP Kinetis MK20D7 device and CMSIS-CORE</description>
      <require condition="MK20D7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

